Решаем задачу "Титаник"

In [13]:
import pandas as pd 
import sklearn 
import numpy as np

In [16]:
df=pd.read_csv('https://storage.googleapis.com/tf-datasets/titanic/train.csv ')
df.head()

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y

In [17]:
df.isna().sum()

survived              0
sex                   0
age                   0
n_siblings_spouses    0
parch                 0
fare                  0
class                 0
deck                  0
embark_town           0
alone                 0
dtype: int64

In [ ]:
df_encoded = pd.get_dummies(df, drop_first=True)
print(df_encoded.head())